In [42]:
person = {
    "first": "Corey",
    "last": "Schafer",
    "email": "coreschafter8@gmail.com"
}

In [43]:
people = {
    "first": ["Corey"],
    "last": ["Schafer"],
    "email": ["coreschafter8@gmail.com"]
}

In [44]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["coreschafter8@gmail.com", 'janedoe@gmail.com',
              'Johndoe@gmail.com']
}

In [45]:
people['email']

['coreschafter8@gmail.com', 'janedoe@gmail.com', 'Johndoe@gmail.com']

In [46]:
import pandas as pd

In [47]:
df = pd.DataFrame(people)

In [48]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [49]:
df['email']

0    coreschafter8@gmail.com
1          janedoe@gmail.com
2          Johndoe@gmail.com
Name: email, dtype: object

In [12]:
# type(df['email'])

In [50]:
df.email

0    coreschafter8@gmail.com
1          janedoe@gmail.com
2          Johndoe@gmail.com
Name: email, dtype: object

In [46]:
df[['last', 'email']]

      last                    email
0  Schafer  coreschafter8@gmail.com
1      Doe        janedoe@gmail.com
2      Doe        Johndoe@gmail.com

In [51]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [24]:
df.iloc[[0, 1], 2]
#iloc use interger locations.
#Make sure you pass a double bracket so it can fetch the below data
# as intended

0    coreschafter8@gmail.com
1          janedoe@gmail.com
Name: email, dtype: object

In [52]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [70]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [72]:
df.columns = ['first_name', 'last_name', 'email']

In [82]:
#TO CHANGE THE TITLE OF THE COLUMN TO UPPERCASE OR LOWERCASE
# df.columns = [x.upper() for x in df.columns]
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  coreschafter8@gmail.com
1       Jane       Doe        janedoe@gmail.com
2       John       Doe        Johndoe@gmail.com

In [83]:
#TO REPLACE THE COLUMNS THAT HAS SPACE WITH UNDERSCORE OR OTHERWISE
#USING THE .STRING METHOD
df.columns = df.columns.str.replace(' ', '_')
df

  first_name last_name                    email
0      Corey   Schafer  coreschafter8@gmail.com
1       Jane       Doe        janedoe@gmail.com
2       John       Doe        Johndoe@gmail.com

In [85]:
#TO CHANGE SOME COLUMNS(RENAME)
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [86]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [89]:
df.loc[2] = ['John', 'Smith', 'Johnsmith@email.com']

In [92]:
df.loc[2, ['last', 'email']] = ['Doe', 'Johnsmith@email.com']

In [93]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe      Johnsmith@email.com

In [94]:
df.loc[2, 'last'] = 'Smith'

In [95]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith      Johnsmith@email.com

In [ ]:
#DOES THE SAME FUNCTION AS .LOC
df.at[2, 'last'] = 'Doe'

In [96]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith      Johnsmith@email.com

In [112]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Doe'

In [53]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [104]:
#we can use labels for loc
# df.loc[[0, 1], ['email', 'last']]

In [67]:
filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [63]:
#BIG NOTE :
#.loc IS USED TO LOOK UP FOR ROWS AND COLUMNS 
#IF WE USE A LABEL OR BY LABEL

# df.loc[filt]
# =======================
# THE USE OF AND (&) OR(|)
# filt = (df['last'] == 'Schafer') & (df['first'] == 'John')
# filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [69]:
#NOTE THE PARAMETER WE PASSED INSIDE THE BRACKET. 
#.LOC THE FIRST VALUE IS THE ROW
# AND THE SECOND VALUES ARE THE COLUMNS THAT WE WANT
df.loc[-filt, 'email']

1    janedoe@gmail.com
Name: email, dtype: object

In [114]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Doe'

In [54]:
df['email'] = df['email'].str.lower()

In [55]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com

In [ ]:
#MORE ADVANCED METHOD TO CHANGE MULTIPLE ROW AT ONCE.
apply
map
applymap
replace

In [120]:
# Apply is used for calling a function on our values and it 
# can work on either a dataframe or a series object

In [56]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [21]:
def update_email(email):
    return email.upper()

In [22]:
df['email'].apply(update_email)

0    CORESCHAFTER8@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [23]:
df['email'] = df['email'].apply(update_email)

In [57]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com

In [25]:
LAMBDA FUNCTION
df['email'] = df['email'].apply(lambda x: x.lower())

In [27]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com

In [58]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [59]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [33]:
len(df['email'])

3

In [37]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreschafter8@gmail.com
dtype: object

In [38]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreschafter8@gmail.com
dtype: object

In [60]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17

In [61]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreschafter8@gmail.com
1   jane      doe        janedoe@gmail.com
2   john      doe        johndoe@gmail.com

In [62]:
df['first'].map({'Corey', 'Chris', 'Jane', 'Mary'})

TypeError: 'set' object is not callable